---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Electrical.ConduitRun
source: html/b7050951-ee2d-5eff-ba00-e071fefbbc62.htm
---
# ConduitRun Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.